# LinkVisibilityLost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..LinkVisibilityLost Property
BuiltInFailures..::..GroupFailures Class See Also
---
Link visibility overrides will be lost.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LinkVisibilityLost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinkVisibilityLost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LinkVisibilityLost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace